python, numpy, pandas 날짜 타입 비교 및 정리

https://ellun.tistory.com/320

In [3]:
# timestamp -> str
import time
print(time.time())
type(time.time())
timestamp = time.time()
s = str(timestamp)
print(s,type(s))

1627010320.334355
1627010320.3348992 <class 'str'>

In [4]:
# dfatetime -> str
from datetime import datetime
s = datetime.now()
print(s,type(s))

s1 = datetime.now().strftime('%Y-%m-%d %H:%M:%S')
print(s1,type(s1))

2021-07-23 12:18:40.502980 <class 'datetime.datetime'>
2021-07-23 12:18:40 <class 'str'>

In [5]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:13:58'
d = datetime.strptime(s,'%Y-%m-%d %H:%M:%S')
print(d,type(d))

2021-07-20 11:13:58 <class 'datetime.datetime'>

In [6]:
# str-> timestamp
s = '2021-07-20 11:13:58'
timestamp = time.mktime(datetime.strptime(s,'%Y-%m-%d %H:%M:%S').timetuple())
print(timestamp,type(timestamp))

1626747238.0 <class 'float'>

In [7]:
# datetime -> timestamp
timestamp = time.mktime(datetime.today().timetuple())
print(timestamp,type(timestamp))

1627010320.0 <class 'float'>

In [8]:
# timestamp -> datetime
t = time.time()
print(t)
d = datetime.fromtimestamp(t)
print(d,type(d))

1627010321.061456
2021-07-23 12:18:41.061456 <class 'datetime.datetime'>

In [9]:
# 판다스 to_datetime
import pandas as pd
pd.to_datetime(1626751238.7134328,unit='s')

Timestamp('2021-07-20 03:20:38.713432832')

In [10]:
# 1년전 datetime 값
from datetime import timedelta
import time

datetime_now = datetime.now()
datetime_delta = timedelta(days= -365)
print(datetime_delta)
datetime_now + datetime_delta

-365 days, 0:00:00

datetime.datetime(2020, 7, 23, 12, 18, 41, 576381)

In [11]:
# 두 날짜간의 일수 구하기
since_timestamp = datetime.strptime('20180301','%Y%m%d')
until_timestamp = datetime.strptime('20180331','%Y%m%d')
result = since_timestamp - until_timestamp
result

datetime.timedelta(days=-30)

In [12]:
# 특정일 구하기
import datetime
def get_yoil(y,m,d):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()]

get_yoil(2021,7,20)

'TUE'

In [13]:
import pandas as pd
date = pd.Timestamp(1626747931.0,unit='s',tz='Asia/Seoul')
print(date,type(date))

2021-07-20 11:25:31+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [14]:
df = pd.read_csv('dataset/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [16]:
df['New_Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [17]:
df.drop('Date',axis=1,inplace=True)
df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [18]:
df.set_index('New_Date',inplace=True)
df.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [19]:
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [20]:
df_ymd_range = df['2018-06-29':'2018-06-26']
df_ymd_range

Empty DataFrame
Columns: [Close, Start, High, Low, Volume, year, month, day]
Index: []

In [21]:
df_ymd_range = df['2018-06-26':'2018-06-29']
df_ymd_range

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27

In [25]:
df_ym = df.loc['2018-07','Start':'High']
df_ym

            Start   High
New_Date
2018-07-02  10850  10900

In [23]:
import numpy as np
import pandas as pd
# Time Series Basics
from datetime import datetime
dates = [datetime(2011,1,2),datetime(2011,1,5),
        datetime(2011,1,7),datetime(2011,1,8),
        datetime(2011,1,10),datetime(2011,1,12)]

ts = pd.Series(np.random.randn(6), index=dates)
ts

2011-01-02    0.142828
2011-01-05    0.353757
2011-01-07    0.131270
2011-01-08    1.546121
2011-01-10   -2.392755
2011-01-12   -1.043673
dtype: float64

In [24]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [26]:
ts[::2]

2011-01-02    0.142828
2011-01-07    0.131270
2011-01-10   -2.392755
dtype: float64

In [27]:
ts + ts[::2]

2011-01-02    0.285655
2011-01-05         NaN
2011-01-07    0.262540
2011-01-08         NaN
2011-01-10   -4.785510
2011-01-12         NaN
dtype: float64

In [36]:
tts = ts + ts[::2]
tts.fillna(ts,inplace=True)
tts

2011-01-02    0.285655
2011-01-05    0.353757
2011-01-07    0.262540
2011-01-08    1.546121
2011-01-10   -4.785510
2011-01-12   -1.043673
dtype: float64

In [37]:
ts.index[0]

Timestamp('2011-01-02 00:00:00')

In [38]:
# Indexing, Selection, Subsetting
stamp = ts.index[2]
ts[stamp]

0.13127002854683453

In [39]:
# 2011-01-10 1.089753
print(ts['1/10/2011'])
ts['20110110']

-2.3927551030670733

-2.3927551030670733

In [44]:
longer_ts = pd.Series(np.random.randn(1000),
                                    index=pd.date_range('1/1/2000',periods=1000))
print(longer_ts,'\n')

2000-01-01    1.259110
2000-01-02   -0.403086
2000-01-03   -0.228563
2000-01-04   -0.348126
2000-01-05    1.466662
                ...
2002-09-22   -0.047361
2002-09-23    1.460932
2002-09-24    1.660415
2002-09-25    0.215811
2002-09-26   -0.347663
Freq: D, Length: 1000, dtype: float64

In [45]:
# 5월 5개만 출력
longer_ts['2001-05'][:5]

2001-05-01   -0.417839
2001-05-02    1.018645
2001-05-03    0.875951
2001-05-04    0.661336
2001-05-05    1.197065
Freq: D, dtype: float64

In [46]:
ts[datetime(2011,1,7):]

2011-01-07    0.131270
2011-01-08    1.546121
2011-01-10   -2.392755
2011-01-12   -1.043673
dtype: float64

In [47]:
ts

2011-01-02    0.142828
2011-01-05    0.353757
2011-01-07    0.131270
2011-01-08    1.546121
2011-01-10   -2.392755
2011-01-12   -1.043673
dtype: float64

In [48]:
# truncate
print(ts.truncate(before='2011-01-05',after='2011-01-10'))

2011-01-05    0.353757
2011-01-07    0.131270
2011-01-08    1.546121
2011-01-10   -2.392755
dtype: float64